asuFlumeCleanCases/3dRUN_TopoCase/constant/momentumTransport.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;


RAS
{
    model    RNGkEpsilon;

    turbulence      on;
    printCoeffs     on;
}


LES
{
  model Smagorinsky;
  turbulence on;
  delta cubeRootVol;
  cubeRootVolCoeffs
    {
      deltaCoeff 1;
    }
}


// ************************************************************************* //
