asuFlumeCleanCases/3dRUN_TopoCase/0/Ydefault.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      Ydefault.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform 1;
        name            timeDependentAlpha;
        code            #{
        scalar t = this->db().time().value();
        scalarField& field = *this;

        // Set alpha value based on time
        if (((t >= 0.0) && (t <= 5.0)))
        {
            field = scalar(0.7);  // Set alpha value to 0.3
        }
        else
        {
            field = scalar(0.0);  // Set alpha value to 0.0
        }
    #};
    }
    top
    {
        type            calculated;
        value           uniform 1;
    }
    groundAndWall
    {
        type            calculated;
        value           uniform 1;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
