asuFlumeCleanCases/3dRUN_TopoCase/0/createMesh.sh
foamCleanCase

blockMesh > log.blockMesh

# remove previous 0 folder and copy not-initialized fields
rm -rf 0
cp -r org.0 0


python createTopo.py 

decomposePar

# Grid deformation
mpirun -np 8 topoGridNew -parallel > log.topoGrid

mpirun -np 8 checkMesh -parallel -allGeometry -allTopology -writeSets > log.checkMesh

reconstructPar -withZero

cp -r 0/polyMesh constant/
rm -rf 0/polyMesh

# checkMesh -allGeometry -allTopology -writeSets

