asuFlumeCleanCases/3dRUN_TopoCase/0/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    front 
    {
        type            empty;
        inGroups           1 (frontAndBack);
    }
    back
    {
        type            empty;
        inGroups           1 (frontAndBack);
    }   
    top
    {
        inGroups	    1 (outOrIn);
    }
    side	
    {
        inGroups	    1 (outOrIn);
    }
}

// ************************************************************************* //
