asuFlumeCleanCases/3dRUN_TopoCase/0/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/
FoamFile
{
format    ascii;
class     dictionary;
location  "system";
object   functions;
}
// ************************************************************************* //

    #includeFunc graphUniform
    (
	name=line1,
	start=(0.5 0 0),
        end=(0.5 .25 0),
        nPoints=50,
        fields=(alpha.particles1)
    )

    #includeFunc graphUniform
    (
        name=line2,
        start=(0.75 0 0),
        end=(0.75 .25 0),
        nPoints=50,
        fields=(alpha.particles1)
    )

    #includeFunc graphUniform
    (
        name=pressureLine,
        start=(0 0.025 0),
        end=(1 0.025 0),
        nPoints=200,
	axis=x,
        fields=(p)
    )

/*
    #includeFunc graphLayerAverage
    (
        patches=(inlet),
        axis=x,
        fields=(p U)
    )
*/
